/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   error_check.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mtsuji <mtsuji@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/01/17 18:51:23 by mtsuji            #+#    #+#             */
/*   Updated: 2022/01/17 18:51:28 by mtsuji           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../includes/push_swap.h"

/*エラーケースの対処。
**同じ数字が複数出てくる場合、
**数字以外の文字列があった場合
**-が２連続で現れた場合（１文字までは許容）= atoiでカバーできているはず。
**
**
*/
/*
void    double_digit(t_stack **stack)
{
    
}
*/